# Главная страница доступна анонимному пользователю.

# Аутентифицированному пользователю доступна страница со списком заметок notes/,
#  страница успешного добавления заметки done/, страница добавления новой заметки add/.

# Страницы отдельной заметки, удаления и редактирования заметки доступны только 
# автору заметки. Если на эти страницы попытается зайти другой пользователь — вернётся ошибка 404.

# При попытке перейти на страницу списка заметок, страницу успешного добавления 
# записи, страницу добавления заметки, отдельной заметки, редактирования или удаления 
# заметки анонимный пользователь перенаправляется на страницу логина.

# Страницы регистрации пользователей, входа в учётную запись и выхода из неё доступны всем пользователям.